tests/Cases/Case-mmcClouds/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    side
    {
        type            inletOutlet;
        inletValue      uniform 293;
        value           uniform 293;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 291;
    }
    pilot
    {
        type            fixedValue;
        value           uniform 1880;
    }
    inletFuel
    {
        type            fixedValue;
        value           uniform 294;
    }

}


// ************************************************************************* //
