tests/Cases/Case-mmcClouds/0/boundaryRho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      boundaryRho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1.2;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.2;
        value           uniform 1.2;
    }
    side
    {
        type            inletOutlet;
        inletValue      uniform 1.2;
        value           uniform 1.2;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 1.2;
    }
    inletFuel
    {
        type            fixedValue;
        value           uniform 1.2;
    }
    pilot
    {
        type            fixedValue;
        value           uniform 1.2;
    }
}


// ************************************************************************* //
