tests/Cases/Case-mmcClouds/0/hEqvE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      boundaryRho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 354000;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 354000;
        value           uniform 354000;
    }
    side
    {
        type            inletOutlet;
        inletValue      uniform 354000;
        value           uniform 354000;
    }
    inletCoflow
    {
        type            fixedValue;
        value           uniform 354000;
    }
    pilot
    {
        type            fixedValue;
        value           uniform 354000;
    }
    inletFuel
    {
        type            fixedValue;
        value           uniform 354000;
    }
}


// ************************************************************************* //
